# Automative

In [1]:
import pandas as pd
import os

### Load

In [2]:
data_location = os.path.abspath(os.path.dirname('.'))
csv_location = os.path.join(data_location, "Automobile_data.csv")
print(data_location)

C:\Users\Andreia Almeida\Desktop\SC

In [3]:
df_csv = pd.read_csv(csv_location)#na_values=["?"]

In [4]:
df_csv.head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

In [5]:
len(df_csv)

61

In [6]:
#searching for unwanted chars
interrogations_check = df_csv.to_string().__contains__('?')
print(interrogations_check)

False

In [7]:
df_csv[df_csv.iloc[:, 4] == 141.1]

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
13,16,chevrolet,hatchback,88.4,141.1,l,three,48,47,5151.0

In [8]:
df_csv[df_csv.iloc[:, 5] == 'l']

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
13,16,chevrolet,hatchback,88.4,141.1,l,three,48,47,5151.0

In [9]:
#most expensive car
#x = max(df_csv.iloc[:, -1])
df_csv[df_csv.iloc[:, -1] == 45400.0]

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
35,47,mercedes-benz,hardtop,112.0,199.2,ohcv,eight,184,14,45400.0

In [10]:
#all toyota cars (7)
df_csv[df_csv.iloc[:, 1] == 'toyota']

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
48,66,toyota,hatchback,95.7,158.7,ohc,four,62,35,5348.0
49,67,toyota,hatchback,95.7,158.7,ohc,four,62,31,6338.0
50,68,toyota,hatchback,95.7,158.7,ohc,four,62,31,6488.0
51,69,toyota,wagon,95.7,169.7,ohc,four,62,31,6918.0
52,70,toyota,wagon,95.7,169.7,ohc,four,62,27,7898.0
53,71,toyota,wagon,95.7,169.7,ohc,four,62,27,8778.0
54,79,toyota,wagon,104.5,187.8,dohc,six,156,19,15750.0

In [11]:
df_csv['company'].value_counts()
#total_cars = df_csv['company']
#total_cars = total_cars.to_frame()

#total_cars = total_cars.groupby('company').count()#as_index=False
#total_cars.head()

toyota           7
bmw              6
nissan           5
mazda            5
audi             4
mercedes-benz    4
mitsubishi       4
volkswagen       4
porsche          3
honda            3
alfa-romero      3
jaguar           3
isuzu            3
chevrolet        3
volvo            2
dodge            2
Name: company, dtype: int64

In [12]:
df_csv = df_csv.sort_values(by=['price'], ascending=True)
df_csv.head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
13,16,chevrolet,hatchback,88.4,141.1,l,three,48,47,5151.0
27,36,mazda,hatchback,93.1,159.1,ohc,four,68,30,5195.0
48,66,toyota,hatchback,95.7,158.7,ohc,four,62,35,5348.0
36,49,mitsubishi,hatchback,93.7,157.3,ohc,four,68,37,5389.0
28,37,mazda,hatchback,93.1,159.1,ohc,four,68,31,6095.0

In [13]:
GermanCars_dict = {'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'], 'Price': [23845, 171995, 135925 , 71400]}
japaneseCars_dict = {'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi '], 'Price': [29995, 23600, 61500 , 58900]}

In [14]:
GermanCars = pd.DataFrame(GermanCars_dict)
japaneseCars = pd.DataFrame(japaneseCars_dict)
G_J_cars_df = pd.concat([GermanCars,japaneseCars], keys=["Germany", "Japan"])
G_J_cars_df.head(25)

               Company   Price
Germany 0         Ford   23845
        1     Mercedes  171995
        2          BMV  135925
        3         Audi   71400
Japan   0       Toyota   29995
        1        Honda   23600
        2       Nissan   61500
        3  Mitsubishi    58900

In [15]:
Car_Price_dict = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'Price': [23845, 17995, 135925 , 71400]}
car_Horsepower_dict = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'horsepower': [141, 80, 182 , 160]}

In [16]:
Car_Price = pd.DataFrame(Car_Price_dict)
car_Horsepower = pd.DataFrame(car_Horsepower_dict)

In [19]:
df_merge = Car_Price.merge(car_Horsepower, on='Company')
df_merge.head()

  Company   Price  horsepower
0  Toyota   23845         141
1   Honda   17995          80
2     BMV  135925         182
3    Audi   71400         160